// //
// // задача №1 ##Конвертер миль в километры
// let mille=130;
// const km_to_mile=209.2142 / 130;
// let km=mille*km_to_mile;
// console.log(km);
//
//##Вычислитель индекса массы тела (ИМТ)
// Установите значения для роста в дюймах и веса в фунтах, затем преобразуйте значения в сантиметры и килограммы:
// 1 дюйм равен 2,54 см;
// 2,2046 фунта равны 1 кг.
// Выведите результаты. Затем рассчитайте и запишите ИМТ: он равен весу (в кило­граммах), деленному на квадрат роста (в метрах). Выведите результаты на экран. */
//
let H_IN_INCH = 73;
let W_IN_POUND = 231;
const INCH_TO_M = 2.54 / 100;
const POUND_TO_KG = 1 / 2.2046;
let BMI = (W_IN_POUND * POUND_TO_KG) / (H_IN_INCH * INCH_TO_M)**2;
console.log(BMI);